<?php

return [
    'characters' => '23678',      // حروف و اعدادی که داخل کپچا نمایش داده میشن (اعداد ساده و غیر گیج‌کننده)
    'length' => 4,                  // تعداد کاراکترهای کپچا (مثلاً ۴ رقم)
    'width' => 200,                 // عرض تصویر کپچا به پیکسل
    'height' => 80,                 // ارتفاع تصویر کپچا به پیکسل
    'quality' => 90,                // کیفیت تصویر کپچا (از ۰ تا 100)
    'math' => false,                // آیا کپچا به صورت سوال ریاضی نمایش داده شود یا خیر (false یعنی خیر)
    'expire' => 120,                // مدت زمان اعتبار کپچا به ثانیه (بعد از این مدت کپچا منقضی می‌شود)
    'bgImage' => false,             // آیا از تصویر پس‌زمینه استفاده شود یا نه (false یعنی پس‌زمینه ساده رنگی)
    'bgColor' => '#000000',         // رنگ پس‌زمینه کپچا (در اینجا سیاه)
    'fontColors' => ['#ffffff'],    // رنگ فونت کپچا به صورت آرایه (در اینجا سفید ثابت برای همه کاراکترها)
    'contrast' => -5,               // میزان کنتراست تصویر کپچا (عدد منفی کنتراست را کم می‌کند)
    'sharpen' => 1,                // میزان وضوح تصویر (عدد بالاتر یعنی تصویر تیزتر)
    'blur' => -80,                    // میزان تاری تصویر (۰ یعنی بدون تاری)
    'lines' => 0,                   // تعداد خطوط نویزی روی کپچا (۰ یعنی بدون خطوط اضافی)
    'bgLines' => 0,                 // تعداد خطوط پس‌زمینه (۰ یعنی بدون خطوط پس‌زمینه)
    // 'fonts' => [],               // آرایه فونت‌ها (اینجا حذف شده چون فونت استفاده نمی‌کنیم)
];
